tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "zsh"
brew "git"
brew "tig"
brew "gh"
brew "tmux"
brew "neovim"
brew "coreutils"
brew "starship"
brew "direnv"
brew "lima"
brew "podman"
brew "docker"
brew "jq"
brew "yq"
brew "tree"
brew "gat"
brew "eza"
brew "ripgrep"
brew "asdf"
brew "kubectl"
brew "minikube"
brew "kind"
brew "k9s"
brew "kubectx"
brew "terraform"
brew "awscli"
brew "firebase-cli"
cask "flutter"
cask "stats"
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "cursor"
cask "google-chrome"
cask "zoom"
cask "slack"
cask "miro"
cask "deepl"
cask "inkscape"
cask "raycast"
cask "figma"
cask "wezterm"
cask "font-hackgen-nerd"
cask "font-monaspace"
cask "raspberry-pi-imager"
