# --- Tap repositories ---
tap "homebrew/bundle"
tap "charmbracelet/tap"
tap "azure/functions"
tap "k1LoW/tap"
tap "steipete/tap"

# --- Shell & Environment ---
brew "zsh"
brew "zsh-autosuggestions"
brew "atuin"
brew "zsh-fast-syntax-highlighting"
brew "starship"
brew "stow"

# --- Development CLI ---
brew "git"
brew "git-lfs"
brew "git-delta"
brew "tig"
brew "lazygit"
brew "serie"
brew "gh"
brew "k1LoW/tap/git-wt"
brew "worktrunk"
brew "actionlint"
brew "gitleaks"
brew "shellcheck"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "tree"
brew "jq"
brew "yq"
brew "xh"
brew "bottom"
brew "yazi"
brew "glow"
brew "freeze"
brew "mise"
brew "pipx"
brew "uv"

# --- Container & VM ---
brew "podman"
cask "orbstack"

# --- Cloud & IaC ---
brew "tfenv"
brew "tflint"
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@4"
cask "gcloud-cli"

# --- Development Apps ---
cask "wezterm"
cask "visual-studio-code"
cask "flutter"

# --- Utility Apps ---
cask "stats"
cask "rectangle"
cask "alt-tab"
cask "raycast"
cask "libreoffice"
cask "inkscape"
cask "logi-options+"
cask "deepl"
cask "obsidian"

# --- Fonts ---
cask "font-hackgen-nerd"
cask "font-monaspace"
cask "font-moralerspace"
cask "font-jetbrains-mono-nerd-font"
cask "font-overpass-nerd-font"

# --- Browsers ---
cask "google-chrome"
cask "microsoft-edge"

# --- Communication & Collaboration ---
cask "slack"
cask "discord"
cask "zoom"
cask "miro"
cask "figma"

# --- AI Tools ---
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "kiro-cli"
cask "copilot-cli"
