tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "charmbracelet/tap"
tap "azure/functions"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "git"
brew "tig"
brew "gh"
brew "ghq"
brew "actionlint"
brew "tmux"
brew "neovim"
brew "coreutils"
brew "starship"
brew "direnv"
brew "lima"
brew "podman"
brew "jq"
brew "yq"
brew "tree"
brew "gat"
brew "eza"
brew "ripgrep"
brew "fzf"
brew "httpie"
brew "htop"
brew "freeze"
brew "mise"
brew "kubectl"
brew "minikube"
brew "kind"
brew "k9s"
brew "kubectx"
brew "tfenv"
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "firebase-cli"
brew "llm"
cask "flutter"
cask "stats"
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "cursor"
cask "google-chrome"
cask "zoom"
cask "slack"
cask "discord"
cask "miro"
cask "deepl"
cask "inkscape"
cask "raycast"
cask "figma"
cask "wezterm"
cask "font-hackgen-nerd"
cask "font-monaspace"
cask "raspberry-pi-imager"
cask "asana"
cask "microsoft-edge"
cask "ollama"
cask "rectangle"
cask "chatgpt"
cask "claude"
cask "amazon-q"
cask "logi-options+"
